OpenROAD 26Q1-951-g6975124cf2 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 2 thread(s).
read_liberty /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
[INFO ODB-0227] LEF file: /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/lef/sky130_fd_sc_hd.tlef, created 13 layers, 25 vias
[INFO ODB-0227] LEF file: /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/lef/sky130_fd_sc_hd_merged.lef, created 441 library cells
link_design -hier riscv
[WARNING ORD-0011] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/setRC.tcl
write_db ./results/sky130hd/riscv32i/base/1_synth.odb
write_sdc -no_timestamp ./results/sky130hd/riscv32i/base/1_synth.sdc
Elapsed time: 0:01.31[h:]min:sec. CPU time: user 0.97 sys 0.10 (81%). Peak memory: 132012KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            1            128 546ff727ca04f4ce5b10
