OpenROAD 26Q1-951-g6975124cf2 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 2 thread(s).
read_liberty /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db -hier ./results/sky130hd/riscv32i/base/2_2_floorplan_macro.odb
[WARNING ORD-0012] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 1768 tapcells.
write_db ./results/sky130hd/riscv32i/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.72[h:]min:sec. CPU time: user 0.60 sys 0.09 (96%). Peak memory: 127248KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            124 4b12d1717536c540472e
