OpenROAD 26Q1-951-g6975124cf2 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 2 thread(s).
read_liberty /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db -hier ./results/sky130hd/riscv32i/base/3_1_place_gp_skip_io.odb
[WARNING ORD-0012] Hierarchical flow (-hier) is currently in development and may cause multiple issues. Do not use in production environments.
source /workspaces/vsd-scl180-orfs_workshop/orfs/flow/platforms/sky130hd/setRC.tcl
place_pins -hor_layers met3 -ver_layers met2
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 1340
[INFO PPL-0002] Number of I/O             165
[INFO PPL-0003] Number of I/O w/sink      165
[INFO PPL-0004] Number of I/O w/o sink    0
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 28304.63 um.
write_db ./results/sky130hd/riscv32i/base/3_2_place_iop.odb
Elapsed time: 0:00.86[h:]min:sec. CPU time: user 0.68 sys 0.09 (90%). Peak memory: 132452KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            129 11b4925a379cbaca9cc9
